/******************************************************************************

                  版权所有 (C), , 

 ******************************************************************************
  文 件 名   : device_manager.h
  版 本 号   : 初稿
  作    者   : Bruce Feng
  生成日期   : 2017年8月14日
  最近修改   :
  功能描述   : 本文件负责设备管理
  函数列表   :
  修改历史   :
  1.日    期   : 2017年8月14日
    作    者   : Bruce Feng
    修改内容   : 创建文件

******************************************************************************/


#ifndef _DEVICE_MANAGER_H_
#define _DEVICE_MANAGER_H_


class DeviceManager
{
public:

    DeviceManager() {}

    virtual ~DeviceManager() {}
    
};


#endif




