/******************************************************************************

                  版权所有 (C), , 

 ******************************************************************************
  文 件 名   : conf_def.h
  版 本 号   : 初稿
  作    者   : Bruce Feng
  生成日期   : 2017年8月22日
  最近修改   :
  功能描述   : 本文件定义通用配置定义
  函数列表   :
  修改历史   :
  1.日    期   : 2017年8月22日
    作    者   : Bruce Feng
    修改内容   : 创建文件

******************************************************************************/


#ifndef _OS_CONF_DEF_H_
#define _OS_CONF_DEF_H_

#include "param_def.h"


extern sensor_setup_t sensor_setup;
extern pid_setup_t pid_setup;



#endif



