/******************************************************************************

                  版权所有 (C), , 

 ******************************************************************************
  文 件 名   : sem.h
  版 本 号   : 初稿
  作    者   : Bruce Feng
  生成日期   : 2017年3月5日
  最近修改   :
  功能描述   : 本文件负责定义RTX平台的信号量类。
  函数列表   :
  修改历史   :
  1.日    期   : 2017年3月5日
    作    者   : Bruce Feng
    修改内容   : 创建文件

******************************************************************************/

#ifndef _SEM_H_
#define _SEM_H_

#include "sem_def.h"

#ifdef __RTX
#include "rtx_sem.h"
#endif


#endif


