/******************************************************************************

                  版权所有 (C), , 

 ******************************************************************************
  文 件 名   : sem_def.h
  版 本 号   : 初稿
  作    者   : Bruce Feng
  生成日期   : 2017年3月5日
  最近修改   :
  功能描述   : 定义信号量宏定义
  函数列表   :
  修改历史   :
  1.日    期   : 2017年3月5日
    作    者   : Bruce Feng
    修改内容   : 创建文件

******************************************************************************/

#ifndef _SEM_DEF_H_
#define _SEM_DEF_H_

#define SEM_OK                  0
#define SEM_TIMEOUT     1

#endif


