/******************************************************************************

                  版权所有 (C), , 

 ******************************************************************************
  文 件 名   : mutex.h
  版 本 号   : 初稿
  作    者   : Bruce Feng
  生成日期   : 2017年3月7日
  最近修改   :
  功能描述   : 本文件负责互斥量的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2017年3月7日
    作    者   : Bruce Feng
    修改内容   : 创建文件

******************************************************************************/

#ifndef _MUTEX_H_
#define _MUTEX_H_

#ifdef __RTX
#include "rtx_mutex.h"
#endif


#endif


